cmsis-svd/cmsis-svd/data/Renesas/R7FA4M1.svd
                <register derivedFrom="P000PFS_HA">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>P50%sPFS_HA</name>
                    <description>P50%s Pin Function Control Register</description>
                    <alternateRegister>P50%sPFS</alternateRegister>
                    <addressOffset>0x142</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>P50%sPFS_BY</name>
                    <description>P50%s Pin Function Control Register</description>
                    <alternateRegister>P50%sPFS</alternateRegister>
                    <addressOffset>0x143</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>P60%sPFS</name>
                    <description>P60%s Pin Function Control Register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>P60%sPFS_HA</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x182</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>P60%sPFS_BY</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x183</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P60%sPFS</name>
                    <description>P60%s Pin Function Control Register</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P60%sPFS_HA</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x1A2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P60%sPFS_BY</name>
                    <description>P60%s Pin Function Control Register</description>
                    <alternateRegister>P60%sPFS</alternateRegister>
                    <addressOffset>0x1A3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <name>P610PFS</name>
                    <description>P610 Pin Function Control Register</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <name>P610PFS_HA</name>
                    <description>P610 Pin Function Control Register</description>
                    <alternateRegister>P610PFS</alternateRegister>
                    <addressOffset>0x1AA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <name>P610PFS_BY</name>
                    <description>P610 Pin Function Control Register</description>
                    <alternateRegister>P610PFS</alternateRegister>
                    <addressOffset>0x1AB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <name>P708PFS</name>
                    <description>P708 Pin Function Control Register</description>
                    <addressOffset>0x1E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <name>P708PFS_HA</name>
                    <description>P708 Pin Function Control Register</description>
                    <alternateRegister>P708PFS</alternateRegister>
                    <addressOffset>0x1E2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <name>P708PFS_BY</name>
                    <description>P708 Pin Function Control Register</description>
                    <alternateRegister>P708PFS</alternateRegister>
                    <addressOffset>0x1E3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P80%sPFS</name>
                    <description>P80%s Pin Function Control Register</description>
                    <addressOffset>0x220</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P80%sPFS_HA</name>
                    <description>P80%s Pin Function Control Register</description>
                    <alternateRegister>P80%sPFS</alternateRegister>
                    <addressOffset>0x222</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>8-9</dimIndex>
                    <name>P80%sPFS_BY</name>
                    <description>P80%s Pin Function Control Register</description>
                    <alternateRegister>P80%sPFS</alternateRegister>
                    <addressOffset>0x223</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
