cmsis-svd/cmsis-svd/data/Renesas/R7FA4M1.svd
                <register>
                    <name>ADCMPLR1</name>
                    <description>A/D Compare Function Window A Comparison Condition Setting Register 1</description>
                    <addressOffset>0x09A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPLCHA25</name>
                            <description>Comparison condition of AN025</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA24</name>
                            <description>Comparison condition of AN024</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA23</name>
                            <description>Comparison condition of AN023</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA22</name>
                            <description>Comparison condition of AN022</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA21</name>
                            <description>Comparison condition of AN021</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA20</name>
                            <description>Comparison condition of AN020</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA19</name>
                            <description>Comparison condition of AN019</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA18</name>
                            <description>Comparison condition of AN018</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA17</name>
                            <description>Comparison condition of AN017</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA16</name>
                            <description>Comparison condition of AN016</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPDR0</name>
                    <description>A/D Compare Function Window A Lower-Side Level Setting Register</description>
                    <addressOffset>0x09C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADCMPDR0</name>
                            <description>The ADCMPDR0 register sets the reference data when the compare window A function is used. ADCMPDR0 sets the lower-side level of window A.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPDR1</name>
                    <description>A/D Compare Function Window A Upper-Side Level Setting Register</description>
                    <addressOffset>0x09E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADCMPDR1</name>
                            <description>The ADCMPDR1 register sets the reference data when the compare window A function is used. ADCMPDR1 sets the upper-side level of window A..</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
